<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006-2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | Nacos 2.x设置
// +----------------------------------------------------------------------

return [
    // 启用Nacos
    'enable' => false,
    // 启用Nacos授权认证，如果启用，需要配置用户名和密码
    'enableAuth' => true,
    // 项目名称
    'name' => 'thinkphp-nacos-client',
    // Nacos 主机地址
    'host' => '127.0.0.1',
    // Nacos 服务端口
    'port' => 8848,
    // 使用https访问
    'https' => false,
    // 用户名
    'username' => 'nacos',
    // 密码
    'password' => 'nacos',
    // 命名空间
    'namespace' => '',
    // 环境信息
    'env' => '',
    // 配置ID
    'dataId' => '',
    // 配置分组
    'group' => 'DEFAULT_GROUP',

    // 日志级别
    'logLevel' => 'info',
    // 启用调试模式
    'isDebug' => false,
];